package top.bienvenido.date_24323;

import android.hardware.display.DisplayManagerGlobal;

public final class f extends 我是月黑风高偷你妈棺材钱的爹 {
   public static final f 要不要把你妈卵子扣出来给你做寿司吃 = new f();

   @Override
   public final void ____________________________________________/* $VF was: 狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰 */() {
      this.狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰 = q4.我要送你妈一朵花哈哈哈开玩笑的我哪来的花你哪来的妈;
      Object obj2 = r2.____________________________________________/* $VF was: 狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰 */(
            DisplayManagerGlobal.class, "getInstance", g.要不要把你妈卵子扣出来给你做寿司吃
         )
         .____________________________________________/* $VF was: 狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰 */(null);
      s2 s2Var;
      Object obj;
      a1 a1Var;
      if (obj2 != null
         && (
               obj = (s2Var = r2.____________________________________________/* $VF was: 狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰 */(
                     DisplayManagerGlobal.class, "mDm"
                  ))
                  .____________________________________________/* $VF was: 狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰 */(obj2)
            )
            != null
         && (a1Var = this.____________________________________________/* $VF was: 狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰 */("display", obj)) != null) {
         s2Var.____________________________________________/* $VF was: 狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰 */(
            obj2, a1Var.你爹我一顿暴打揍的你瞎妈的子宫打成稀巴烂浆糊然后把你蠢妈的肠子都拉出来做成美味可口的香肠大发慈悲喂给路边的那些流浪汉吃
         );
      }
   }
}
