package top.bienvenido.date_24323;

public final class n2 extends s2 {
   public s2 要不要把你妈卵子扣出来给你做寿司吃;

   public n2(String str) {
      this.要不要把你妈卵子扣出来给你做寿司吃 = new m2(str, this);
   }

   @Override
   public final Object ____________________________________________/* $VF was: 狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰 */(Object obj) {
      return this.要不要把你妈卵子扣出来给你做寿司吃.____________________________________________/* $VF was: 狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰 */(obj);
   }

   @Override
   public final void ____________________________________________/* $VF was: 狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰 */(Object obj, Object obj2) {
      this.要不要把你妈卵子扣出来给你做寿司吃.____________________________________________/* $VF was: 狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰 */(obj, obj2);
   }
}
