package top.bienvenido.date_24323;

import android.content.pm.PackageInstaller.SessionParams;
import java.lang.reflect.Method;
import kotlin.jvm.functions.Function1;
import kotlin.jvm.internal.Intrinsics;

public final class 你妈妈逼里的微生物细菌太多了我把抗原塞你母亲B里我看看能不能清除细菌 extends a2 {
   public static final 你妈妈逼里的微生物细菌太多了我把抗原塞你母亲B里我看看能不能清除细菌 狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰 = new 你妈妈逼里的微生物细菌太多了我把抗原塞你母亲B里我看看能不能清除细菌();
   public static final 你爹我操你妈的时候怎么没把你射墙上呢 要不要把你妈卵子扣出来给你做寿司吃 = new 你爹我操你妈的时候怎么没把你射墙上呢();
   public static final 有空搁爷这bbll不如赶紧买张高铁票赶回家趁你妈弥留之际问清楚你到底几个爹 我要送你妈一朵花哈哈哈开玩笑的我哪来的花你哪来的妈 = new 有空搁爷这bbll不如赶紧买张高铁票赶回家趁你妈弥留之际问清楚你到底几个爹();
   public static final 当初就应该把你射在墙上你个狗儿子 你爹我一顿暴打揍的你瞎妈的子宫打成稀巴烂浆糊然后把你蠢妈的肠子都拉出来做成美味可口的香肠大发慈悲喂给路边的那些流浪汉吃 = new 当初就应该把你射在墙上你个狗儿子();
   public static final 你梅毒婊子妈给我开着装甲车碾成一滩烂泥竟然组合成了一副精美无比的拼图拼好后上面写着13个大字欢迎你陪你妈来阴间卖逼 你妈今晚去偷电线杆子你爸去找电箱之后结合疯狂爆电让后在拿电线杆子ziwei完事还要去加油站在自己piyan和逼里灌油拿着打火机狂撩自己把自己变成内燃机 = new 你梅毒婊子妈给我开着装甲车碾成一滩烂泥竟然组合成了一副精美无比的拼图拼好后上面写着13个大字欢迎你陪你妈来阴间卖逼();

   public static final Object ____________________________________________/* $VF was: 狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰 */(Object obj) {
      return z0.____________________________________________/* $VF was: 狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰 */(
         obj,
         父母们悬挂树木从尸体中养猪让灵车漂浮跳过坟墓螺旋爆炸砂纸打磨棺材冲浪火烧用尸体泡茶将米与骨灰混合在祖坟前唱歌以及埋葬聚会葬礼庆典骨髓汤浇脑花棺材开花.用搅拌机把你妈的阴扩一下
            ? new v4(
               SessionParams.class, 爷一刀插进你婊子妈的尸体里把你妈的腐烂死尸疼得鲤鱼打挺诈尸起来再一刀把它送回西天极乐净土反反复复让他还没火化的腐尸来来回回做几百个仰卧起坐.狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰, null
            )
            : q4.我要送你妈一朵花哈哈哈开玩笑的我哪来的花你哪来的妈
      );
   }

   @Override
   public final Object ____________________________________________/* $VF was: 狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰 */(
      Object obj, Method method, Object[] objArr
   ) {
      String string = null;
      Object obj2 = objArr[0];
      if (obj2 != null) {
         try {
            string = obj2.toString();
         } catch (Exception var10) {
         }
      } else {
         string = null;
      }

      if (c4.狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰 && string != null) {
         if (Intrinsics.areEqual(string, c4.要不要把你妈卵子扣出来给你做寿司吃)) {
            return z2.我要送你妈一朵花哈哈哈开玩笑的我哪来的花你哪来的妈;
         }

         final String str = string;
         Integer num = (Integer)a5.你妈今晚去偷电线杆子你爸去找电箱之后结合疯狂爆电让后在拿电线杆子ziwei完事还要去加油站在自己piyan和逼里灌油拿着打火机狂撩自己把自己变成内燃机
            .____________________________________________/* $VF was: 狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰 */(
               new Function1() {
                  public final String f$0 = str;

                  public final Object invoke(Object obj3) {
                     return 你妈妈逼里的微生物细菌太多了我把抗原塞你母亲B里我看看能不能清除细菌.____________________________________________/* $VF was: 狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰 */(
                        this.f$0, (m0)obj3
                     );
                  }
               }
            );
         int iIntValue;
         if (num != null && (iIntValue = num) >= 0) {
            return iIntValue;
         }
      }

      try {
         return method.invoke(obj, objArr);
      } catch (Exception e) {
         return null;
      }
   }

   public static final int ____________________________________________/* $VF was: 狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰 */(String str, m0 m0Var) {
      return m0Var._________________一__________________________一_______________________________一_/* $VF was: 老子可是出了名的中国好舌头当年老子一舌头舔你妈的俩奶子舔完奶子再舔阴蒂把你妈调教像条母狗一样的乖你妈还自愿让老子每天肏哥的鸡巴肏的让你妈每天都跟活在天堂一样 */(
         str
      );
   }

   public final void ____________________________________________/* $VF was: 狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰 */(a1 a1Var) {
      a1Var.狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰
         .____________________________________________/* $VF was: 狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰 */(-268426720, this);
      a1Var.狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰
         .____________________________________________/* $VF was: 狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰 */(-923564278, 要不要把你妈卵子扣出来给你做寿司吃);
      a1Var.狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰
         .____________________________________________/* $VF was: 狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰 */(-1422431960, 我要送你妈一朵花哈哈哈开玩笑的我哪来的花你哪来的妈);
      a1Var.狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰
         .____________________________________________/* $VF was: 狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰 */(
            -1118934913, 你爹我一顿暴打揍的你瞎妈的子宫打成稀巴烂浆糊然后把你蠢妈的肠子都拉出来做成美味可口的香肠大发慈悲喂给路边的那些流浪汉吃
         );
      a1Var.狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰
         .____________________________________________/* $VF was: 狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰 */(
            433060184,
            new d6(
               new Function1() {
                  public final Object invoke(Object obj) {
                     return 你妈妈逼里的微生物细菌太多了我把抗原塞你母亲B里我看看能不能清除细菌.____________________________________________/* $VF was: 狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰 */(
                        obj
                     );
                  }
               }
            )
         );
      a1Var.狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰
         .____________________________________________/* $VF was: 狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰 */(268289313, q4.要不要把你妈卵子扣出来给你做寿司吃);
      a1Var.狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰
         .____________________________________________/* $VF was: 狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰 */(
            -2128065382, 你妈今晚去偷电线杆子你爸去找电箱之后结合疯狂爆电让后在拿电线杆子ziwei完事还要去加油站在自己piyan和逼里灌油拿着打火机狂撩自己把自己变成内燃机
         );
   }
}
