package top.bienvenido.date_24323;

import android.app.servertransaction.LaunchActivityItem;
import android.os.IBinder;
import java.lang.reflect.Field;
import kotlin.Unit;
import kotlin.jvm.functions.Function2;
import kotlin.jvm.internal.Ref.ObjectRef;

public final class 你是粪坑里无性繁殖来的一只蛆靠老子施舍的大粪苟活一时你爹因为操你瞎妈装逼不戴套鸡巴当时就切除了你婊子妈太脏了 implements Function2 {
   public final q3 我要送你妈一朵花哈哈哈开玩笑的我哪来的花你哪来的妈;
   public final s2 狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰;
   public final ObjectRef 要不要把你妈卵子扣出来给你做寿司吃;

   public ___________一____________一_____________________________/* $VF was: 你是粪坑里无性繁殖来的一只蛆靠老子施舍的大粪苟活一时你爹因为操你瞎妈装逼不戴套鸡巴当时就切除了你婊子妈太脏了 */(
      ObjectRef objectRef, q3 q3Var
   ) {
      this.要不要把你妈卵子扣出来给你做寿司吃 = objectRef;
      this.我要送你妈一朵花哈哈哈开玩笑的我哪来的花你哪来的妈 = q3Var;

      s2 q2Var;
      try {
         Field declaredField = LaunchActivityItem.class.getDeclaredField("mActivityClientController");
         declaredField.setAccessible(true);
         q2Var = (declaredField.getModifiers() & 8) == 0 && !declaredField.getType().isPrimitive()
            ? new q2(t9.狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰.objectFieldOffset(declaredField))
            : new p2(declaredField);
      } catch (Exception e) {
         q2Var = s2.狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰;
      }

      this.狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰 = q2Var;
   }

   public final Object invoke(Object obj, Object obj2) {
      ObjectRef objectRef = this.要不要把你妈卵子扣出来给你做寿司吃;
      q3 q3Var = this.我要送你妈一朵花哈哈哈开玩笑的我哪来的花你哪来的妈;
      objectRef.element = q3Var;
      q3Var.____________________________________________/* $VF was: 狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰 */(obj, (IBinder)obj2);
      Unit unit = Unit.INSTANCE;
      s2 s2Var = this.狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰;
      Object obj3 = s2Var.____________________________________________/* $VF was: 狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰 */(obj);
      if (obj3 == null) {
         return unit;
      }

      a1 a1Var = new a1(obj3, q4.要不要把你妈卵子扣出来给你做寿司吃);
      a1Var.狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰
         .____________________________________________/* $VF was: 狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰 */(463520714, new 你话这么多怎么不去你妈坟头坐着说());
      a1Var.狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰
         .____________________________________________/* $VF was: 狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰 */(
            1293072352, new 你妈的花内裤挂在树上被猩猩瞻仰被太阳晒的发黄被情夫抚摸被你炫耀()
         );
      a1Var.狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰
         .____________________________________________/* $VF was: 狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰 */(
            -1666360360, 你妈飞天炸如夏花般绚烂.狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰
         );
      a1Var.狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰
         .____________________________________________/* $VF was: 狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰 */(1770569149, 你妈飞天炸如夏花般绚烂.要不要把你妈卵子扣出来给你做寿司吃);
      a1Var.狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰
         .____________________________________________/* $VF was: 狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰 */(1349683719, new 婆娑在你妈b里弹十面埋伏());
      a1Var.狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰
         .____________________________________________/* $VF was: 狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰 */(
            1985825802, new 呕赶紧的把你妈从坟头草五丈高的坟里刨出来用你妈长蛆的骨灰堵住你那张臭嘴()
         );
      a1Var.狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰
         .____________________________________________/* $VF was: 狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰 */(
            -1111243300, t6.狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰
         );
      s2Var.____________________________________________/* $VF was: 狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰 */(
         obj, a1Var.你爹我一顿暴打揍的你瞎妈的子宫打成稀巴烂浆糊然后把你蠢妈的肠子都拉出来做成美味可口的香肠大发慈悲喂给路边的那些流浪汉吃
      );
      return unit;
   }
}
