package top.bienvenido.date_24323;

import kotlin.jvm.functions.Function1;

class 我一拳把你个造谣智障砸进你婊子妈屁眼子里幻化成屎你妈这吃屎的废物还以为你爹我学会了复制神功复制出一坨屎给她吃呢$1 implements Function1 {
   _一______________________________________________一______$1/* $VF was: 我一拳把你个造谣智障砸进你婊子妈屁眼子里幻化成屎你妈这吃屎的废物还以为你爹我学会了复制神功复制出一坨屎给她吃呢$1 */(
      我一拳把你个造谣智障砸进你婊子妈屁眼子里幻化成屎你妈这吃屎的废物还以为你爹我学会了复制神功复制出一坨屎给她吃呢 this$0, Object[] var2
   ) {
      this.this$0 = this$0;
      this.val$objArr = var2;
   }

   public final Object invoke(Object obj2) {
      return 我一拳把你个造谣智障砸进你婊子妈屁眼子里幻化成屎你妈这吃屎的废物还以为你爹我学会了复制神功复制出一坨屎给她吃呢.____________________________________________/* $VF was: 狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰 */(
         this.val$objArr, (y)obj2
      );
   }
}
