package top.bienvenido.date_24323;

import android.bluetooth.BluetoothAdapter;

public final class 我怕你爸外遇不够多死着死着就没妈了 extends 我是月黑风高偷你妈棺材钱的爹 {
   public static final 我怕你爸外遇不够多死着死着就没妈了 要不要把你妈卵子扣出来给你做寿司吃 = new 我怕你爸外遇不够多死着死着就没妈了();

   @Override
   public final void ____________________________________________/* $VF was: 狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰 */() {
      a2 a2Var = q4.____________________________________________/* $VF was: 狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰 */(q4.我要送你妈一朵花哈哈哈开玩笑的我哪来的花你哪来的妈);
      this.狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰 = a2Var;
      BluetoothAdapter defaultAdapter = BluetoothAdapter.getDefaultAdapter();
      if (defaultAdapter != null) {
         n2 n2Var = new n2("mManagerService");
         Object obj = n2Var.要不要把你妈卵子扣出来给你做寿司吃
            .____________________________________________/* $VF was: 狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰 */(defaultAdapter);
         a1 a1Var;
         if (obj != null
            && (a1Var = this.____________________________________________/* $VF was: 狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰 */("bluetooth_manager", obj))
               != null) {
            n2Var.要不要把你妈卵子扣出来给你做寿司吃
               .____________________________________________/* $VF was: 狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰 */(
                  defaultAdapter, a1Var.你爹我一顿暴打揍的你瞎妈的子宫打成稀巴烂浆糊然后把你蠢妈的肠子都拉出来做成美味可口的香肠大发慈悲喂给路边的那些流浪汉吃
               );
            obfclass2 r0 = new obfclass2(0);
            a1Var.狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰
               .____________________________________________/* $VF was: 狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰 */(
                  -1296507092, new 在我今晚就把你妈墓碑掰弯(r0, a2Var)
               );
            a1Var.狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰
               .____________________________________________/* $VF was: 狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰 */(
                  2097720179, new 你家被你爹派去的野狗们抢劫灭门你妈全身洞大开迎接狗鸡巴奄奄一息而你却还在这里执着的送妈增加你妈的负担你真是个纯狗篮子你爹本人都忍不住把你就地火化以告你妈在天之灵(r0, a2Var)
               );
            a1Var.狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰
               .____________________________________________/* $VF was: 狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰 */(-110831682, new p4("02:00:00:00:00:00"));
            if (父母们悬挂树木从尸体中养猪让灵车漂浮跳过坟墓螺旋爆炸砂纸打磨棺材冲浪火烧用尸体泡茶将米与骨灰混合在祖坟前唱歌以及埋葬聚会葬礼庆典骨髓汤浇脑花棺材开花.用搅拌机把你妈的阴扩一下) {
               try {
                  只有强者才配拥有父母可惜你是孤儿本来就没有父母.要不要把你妈卵子扣出来给你做寿司吃
                     .____________________________________________/* $VF was: 狂犬疫苗忘了给你妈打不好意思让它到处咬人才会生出你这种上缺脑子下缺逼火葬场都不收的烂骨灰 */();
               } catch (Throwable var8) {
               }
            }
         }
      }
   }
}
